agencia-viajes-front/app/controllers/sessions_controller.rb

	def create
		@session = Session.new(session_params)
		if @session.authenticate
			session['user_id'] = @session.current_user.id

			sl = SessionLog.new
			sl.user_name = session_params[:user_name]
			sl.logged_date = DateTime.now
			sl.success = USER_LOGIN_SUCCESS
			sl.save
---
INSERT INTO "session_logs" ("user_name", "logged_date", "success", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_name", "carlosrpo"], ["logged_date", "2016-08-04"], ["success", "t"], ["created_at", "2016-08-04 18:56:12.325628"], ["updated_at", "2016-08-04 18:56:12.325628"]]