agencia-viajes-front/app/controllers/session_logs_controller.rb

SELECT "session_logs".* FROM "session_logs"
---
  def index
    @session_logs = SessionLog.all

DELETE FROM "session_logs" WHERE "session_logs"."id" = ?  [["id", 1]]
---
  def destroy
    @session_log.destroy

SELECT  "session_logs".* FROM "session_logs" WHERE "session_logs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_session_log
      @session_log = SessionLog.find(params[:id])