agencia-viajes-front/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "user_name", "email", "password_digest", "status", "phone", "identification", "birth_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "phone" = ?, "identification" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone", "3017517366"], ["identification", "1036634979"], ["updated_at", "2016-08-06 19:09:48.526724"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)