agencia-viajes-back/app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "last_name", "identification", "email", "phone", "birth_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE "customers" SET "birth_date" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["birth_date", "2012-03-15"], ["updated_at", "2016-08-06 22:16:16.374113"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)