agencia-viajes-back/app/controllers/destinations_controller.rb

  def index
    @destinations = Destination.all
---
SELECT "destinations".* FROM "destinations"

  def create
    @destination = Destination.new(destination_params)

    respond_to do |format|
      if @destination.save
---
INSERT INTO "destinations" ("city", "country", "price", "taxes", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["city", "Medellín"], ["country", "Colombia"], ["price", 1000000], ["taxes", 200000], ["total", 1200000], ["created_at", "2016-08-06 20:39:39.052525"], ["updated_at", "2016-08-06 20:39:39.052525"]]

  def update
    respond_to do |format|
      if @destination.update(destination_params)
---
UPDATE "destinations" SET "country" = ?, "status" = ?, "updated_at" = ? WHERE "destinations"."id" = ?  [["country", "Colombiaaaa"], ["status", "f"], ["updated_at", "2016-08-06 20:40:49.167536"], ["id", 1]]

  def destroy
    @destination.destroy
---
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 2]]

    def set_destination
      @destination = Destination.find(params[:id])
---
SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT 1  [["id", 2]]