agencia-viajes-back/app/controllers/sales_controller.rb

  def create
    @sale = Sale.new(sale_params)

    respond_to do |format|
      if @sale.save
---
INSERT INTO "sales" ("customer_id", "destination_id", "quantity", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 7], ["destination_id", 1], ["quantity", 2], ["total", 2600000], ["created_at", "2016-08-06 22:02:16.594080"], ["updated_at", "2016-08-06 22:02:16.594080"]]

  def update
    respond_to do |format|
      if @sale.update(sale_params)
---
UPDATE "sales" SET "quantity" = ?, "total" = ?, "updated_at" = ? WHERE "sales"."id" = ?  [["quantity", 3], ["total", 3900000], ["updated_at", "2016-08-06 22:08:34.125674"], ["id", 1]]

  def destroy
    @sale.destroy
---
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 1]]