agencia-viajes-back/app/controllers/tokens_controller.rb

SELECT  "tokens".* FROM "tokens" WHERE "tokens"."token" = ? LIMIT 1  [["token", "2795a6e1-9612-4109-b560-8f6b1f8e2684"]]
---
  def index
    @tokens = Token.all

INSERT INTO "tokens" ("token", "number_of_request", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["token", "d660e743-58df-4efd-b651-ed88dcc885b5"], ["number_of_request", 1], ["created_at", "2016-08-07 00:09:32.113807"], ["updated_at", "2016-08-07 00:09:32.113807"]]
---
  def create
    @token = Token.new(token_params)

    respond_to do |format|
      if @token.save

UPDATE "tokens" SET "token" = ?, "number_of_request" = ?, "status" = ?, "updated_at" = ? WHERE "tokens"."id" = ?  [["token", ""], ["number_of_request", 2], ["status", "f"], ["updated_at", "2016-08-07 00:09:51.174897"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @token.update(token_params)

DELETE FROM "tokens" WHERE "tokens"."id" = ?  [["id", 2]]
---
  def destroy
    @token.destroy

SELECT  "tokens".* FROM "tokens" WHERE "tokens"."token" = ? LIMIT 1  [["token", "2795a6e1-9612-4109-b560-8f6b1f8e2684"]]
---
    def set_token
      @token = Token.find(params[:id])